In [1]:
# Separating a column with several information to multiple columns:
import pandas as pd
dict={'name':["Blessing 19","Bunmi 20","Ola 23"], 'school':['unilag','unilorin','uniabuja']}

data = pd.DataFrame(dict)

In [2]:
data

          name    school
0  Blessing 19    unilag
1     Bunmi 20  unilorin
2       Ola 23  uniabuja

In [3]:
data[['name','age']]=data['name'].str.split(' ',1,expand=True)

In [4]:
data

       name    school age
0  Blessing    unilag  19
1     Bunmi  unilorin  20
2       Ola  uniabuja  23

In [5]:
#removing duplicates
dict2=dict={'name':["Blessing","Bunmi","Ola","Blessing"], 'school':['unilag','unilorin','uniabuja','unilag']}
data2= pd.DataFrame(dict2)
data2

       name    school
0  Blessing    unilag
1     Bunmi  unilorin
2       Ola  uniabuja
3  Blessing    unilag

In [6]:
data2.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [7]:
data2.drop_duplicates()

       name    school
0  Blessing    unilag
1     Bunmi  unilorin
2       Ola  uniabuja

In [8]:
# making data uniform/consistent
dict3={'school':['unilag','unilorin','uniabuja'],'temp':[25, 31, 100]}
#from prior knowledge of temperatures in Nigeria we know there is a probblem with 100, it is most likely in fahrenheit scale
data3=pd.DataFrame(dict3)
data3

     school  temp
0    unilag    25
1  unilorin    31
2  uniabuja   100

In [9]:
fah_temp_data=data3[data3['temp']>40]#isolating occurrence most likely to be an error
fah_temp_data

     school  temp
2  uniabuja   100

In [10]:
cel_temp_data=data3[~(data3['temp']>40)]

In [11]:
cel_temp_data

     school  temp
0    unilag    25
1  unilorin    31

In [12]:
def fah_to_cel(fah):
    cel=(fah-32)/1.8
    return cel

In [18]:
fah_temp_data.loc[fah_temp_data.index,'temp']=fah_to_cel(fah_temp_data['temp'])

C:\Users\Olawumi\anaconda3\lib\site-packages\pandas\core\indexing.py:1773: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [14]:
fah_temp_data

     school       temp
2  uniabuja  37.777778

In [16]:
data3=pd.concat([cel_temp_data,fah_temp_data])

In [17]:
data3

     school       temp
0    unilag  25.000000
1  unilorin  31.000000
2  uniabuja  37.777778

In [22]:
# Handling missing values
dict4={'name':["Blessing","Bunmi","Ola",None], 'school':['unilag','unilorin','uniabuja','unijos']}
data4=pd.DataFrame(dict4)

In [23]:
data4

       name    school
0  Blessing    unilag
1     Bunmi  unilorin
2       Ola  uniabuja
3      None    unijos

In [24]:
data4.isna()

    name  school
0  False   False
1  False   False
2  False   False
3   True   False

In [25]:
#we can either drop it or fill it manually based on some extra knowledge, with numbers we can use a summary statistic like mean etc.
data4.dropna(inplace=True)

In [26]:
data4

       name    school
0  Blessing    unilag
1     Bunmi  unilorin
2       Ola  uniabuja

In [29]:
#dealing with wrong data type
dict5={'school':['unilag','unilorin','uniabuja'],'temp':['25', '31', '100']}#the temperatures here are strings and would affect calculations
data5=pd.DataFrame(dict5)
data5.dtypes

school    object
temp      object
dtype: object

In [37]:
data5['temp']=data5['temp'].astype('int64')

In [38]:
data5.dtypes

school    object
temp       int64
dtype: object